OpenFOAM-13/tutorials/incompressibleFluid/waveSubSurface/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setWaves
runApplication decomposePar

runParallel foamRun

runApplication reconstructPar -newTimes

#------------------------------------------------------------------------------
